---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCAnyHandle.GetAttribute(System.String)
source: html/2ee5df0d-54ed-73e7-25d3-6861d5f51092.htm
---
# Autodesk.Revit.DB.IFC.IFCAnyHandle.GetAttribute Method

Gets the attribute by name.

## Syntax (C#)
```csharp
public IFCData GetAttribute(
	string name
)
```

## Parameters
- **name** (`System.String`) - The name.

## Returns
The value.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null